Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbu_bf.h
/**
 * \file IfxEbu_bf.h
 * \brief
 * \copyright Copyright (c) 2019 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC39XB_UM_V1.1.0.R0
 * Specification: TC3xx User Manual V1.1.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Ebu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Ebu_Registers
 * 
 */
#ifndef IFXEBU_BF_H
#define IFXEBU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Ebu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.DISR */
#define IFX_EBU_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.DISS */
#define IFX_EBU_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.EPE */
#define IFX_EBU_CLC_EPE_OFF (8u)

/** \brief Length for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.SYNC */
#define IFX_EBU_CLC_SYNC_OFF (16u)

/** \brief Length for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.DIV2 */
#define IFX_EBU_CLC_DIV2_OFF (17u)

/** \brief Length for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_LEN (2u)

/** \brief Mask for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_MSK (0x3u)

/** \brief Offset for Ifx_EBU_CLC_Bits.EBUDIV */
#define IFX_EBU_CLC_EBUDIV_OFF (18u)

/** \brief Length for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.SYNCACK */
#define IFX_EBU_CLC_SYNCACK_OFF (20u)

/** \brief Length for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_LEN (1u)

/** \brief Mask for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_MSK (0x1u)

/** \brief Offset for Ifx_EBU_CLC_Bits.DIV2ACK */
#define IFX_EBU_CLC_DIV2ACK_OFF (21u)

/** \brief Length for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_LEN (2u)

/** \brief Mask for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_MSK (0x3u)

/** \brief Offset for Ifx_EBU_CLC_Bits.EBUDIVACK */
#define IFX_EBU_CLC_EBUDIVACK_OFF (22u)

/** \brief Length for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.STS */
#define IFX_EBU_MODCON_STS_OFF (0u)

/** \brief Length for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.LCKABRT */
#define IFX_EBU_MODCON_LCKABRT_OFF (1u)

/** \brief Length for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.SDTRI */
#define IFX_EBU_MODCON_SDTRI_OFF (2u)

/** \brief Length for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.CLK_COMB */
#define IFX_EBU_MODCON_CLK_COMB_OFF (3u)

/** \brief Length for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.EXTLOCK */
#define IFX_EBU_MODCON_EXTLOCK_OFF (4u)

/** \brief Length for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.ARBSYNC */
#define IFX_EBU_MODCON_ARBSYNC_OFF (5u)

/** \brief Length for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_LEN (2u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_MSK (0x3u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.ARBMODE */
#define IFX_EBU_MODCON_ARBMODE_OFF (6u)

/** \brief Length for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_LEN (8u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_MSK (0xffu)

