Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbu_bf.h
/** \brief Offset for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_OFF (8u)

/** \brief Length for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_LEN (8u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_MSK (0xffu)

/** \brief Offset for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_OFF (16u)

/** \brief Length for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.FIFO_BYPASS */
#define IFX_EBU_MODCON_FIFO_BYPASS_OFF (24u)

/** \brief Length for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_OFF (25u)

/** \brief Length for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_OFF (26u)

/** \brief Length for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_OFF (30u)

/** \brief Length for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_OFF (31u)

/** \brief Length for Ifx_EBU_MODID_Bits.ID_VALUE */
#define IFX_EBU_MODID_ID_VALUE_LEN (32u)

/** \brief Mask for Ifx_EBU_MODID_Bits.ID_VALUE */
#define IFX_EBU_MODID_ID_VALUE_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBU_MODID_Bits.ID_VALUE */
#define IFX_EBU_MODID_ID_VALUE_OFF (0u)

/** \brief Length for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_OFF (0u)

/** \brief Length for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_LEN (7u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_MSK (0x7fu)

/** \brief Offset for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_OFF (1u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_LEN (4u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_MSK (0xfu)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_OFF (16u)

/** \brief Length for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_LEN (2u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_MSK (0x3u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_OFF (28u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_OFF (30u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_OFF (31u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_OFF (0u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_OFF (1u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_OFF (31u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_OFF (0u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_OFF (1u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_OFF (2u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_OFF (3u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_LEN (4u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_MSK (0xfu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_OFF (4u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_LEN (4u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_MSK (0xfu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_OFF (8u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_LEN (20u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_MSK (0xfffffu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_OFF (12u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_OFF (0u)

