Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbu_bf.h
/** \brief Length for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_OFF (28u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_OFF (0u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_OFF (3u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_OFF (7u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.ECSE */
#define IFX_EBU_BUS_WCON_ECSE_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.ECSE */
#define IFX_EBU_BUS_WCON_ECSE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.ECSE */
#define IFX_EBU_BUS_WCON_ECSE_OFF (16u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.EBSE */
#define IFX_EBU_BUS_WCON_EBSE_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.EBSE */
#define IFX_EBU_BUS_WCON_EBSE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.EBSE */
#define IFX_EBU_BUS_WCON_EBSE_OFF (17u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.WAITINV */
#define IFX_EBU_BUS_WCON_WAITINV_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.WAITINV */
#define IFX_EBU_BUS_WCON_WAITINV_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.WAITINV */
#define IFX_EBU_BUS_WCON_WAITINV_OFF (19u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.BCGEN */
#define IFX_EBU_BUS_WCON_BCGEN_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.BCGEN */
#define IFX_EBU_BUS_WCON_BCGEN_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.BCGEN */
#define IFX_EBU_BUS_WCON_BCGEN_OFF (20u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.PORTW */
#define IFX_EBU_BUS_WCON_PORTW_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.PORTW */
#define IFX_EBU_BUS_WCON_PORTW_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.PORTW */
#define IFX_EBU_BUS_WCON_PORTW_OFF (22u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.WAIT */
#define IFX_EBU_BUS_WCON_WAIT_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.WAIT */
#define IFX_EBU_BUS_WCON_WAIT_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.WAIT */
#define IFX_EBU_BUS_WCON_WAIT_OFF (24u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.AAP */
#define IFX_EBU_BUS_WCON_AAP_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.AAP */
#define IFX_EBU_BUS_WCON_AAP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.AAP */
#define IFX_EBU_BUS_WCON_AAP_OFF (26u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.LOCKCS */
#define IFX_EBU_BUS_WCON_LOCKCS_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.LOCKCS */
#define IFX_EBU_BUS_WCON_LOCKCS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.LOCKCS */
#define IFX_EBU_BUS_WCON_LOCKCS_OFF (27u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.AGEN */
#define IFX_EBU_BUS_WCON_AGEN_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.AGEN */
#define IFX_EBU_BUS_WCON_AGEN_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.AGEN */
#define IFX_EBU_BUS_WCON_AGEN_OFF (28u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.WRDTACS */
#define IFX_EBU_BUS_WAP_WRDTACS_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.WRDTACS */
#define IFX_EBU_BUS_WAP_WRDTACS_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.WRDTACS */
#define IFX_EBU_BUS_WAP_WRDTACS_OFF (0u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.WRRECOVC */
#define IFX_EBU_BUS_WAP_WRRECOVC_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.WRRECOVC */
#define IFX_EBU_BUS_WAP_WRRECOVC_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.WRRECOVC */
#define IFX_EBU_BUS_WAP_WRRECOVC_OFF (4u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.WAITWRC */
#define IFX_EBU_BUS_WAP_WAITWRC_LEN (5u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.WAITWRC */
#define IFX_EBU_BUS_WAP_WAITWRC_MSK (0x1fu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.WAITWRC */
#define IFX_EBU_BUS_WAP_WAITWRC_OFF (7u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.DATAC */
#define IFX_EBU_BUS_WAP_DATAC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.DATAC */
#define IFX_EBU_BUS_WAP_DATAC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.DATAC */
#define IFX_EBU_BUS_WAP_DATAC_OFF (12u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_WAP_EXTCLOCK_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_WAP_EXTCLOCK_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_WAP_EXTCLOCK_OFF (16u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.EXTDATA */
#define IFX_EBU_BUS_WAP_EXTDATA_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.EXTDATA */
#define IFX_EBU_BUS_WAP_EXTDATA_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.EXTDATA */
#define IFX_EBU_BUS_WAP_EXTDATA_OFF (18u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_WAP_CMDDELAY_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_WAP_CMDDELAY_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_WAP_CMDDELAY_OFF (20u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.AHOLDC */
#define IFX_EBU_BUS_WAP_AHOLDC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.AHOLDC */
#define IFX_EBU_BUS_WAP_AHOLDC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.AHOLDC */
#define IFX_EBU_BUS_WAP_AHOLDC_OFF (24u)

/** \brief Length for Ifx_EBU_BUS_WAP_Bits.ADDRC */
#define IFX_EBU_BUS_WAP_ADDRC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_WAP_Bits.ADDRC */
#define IFX_EBU_BUS_WAP_ADDRC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_WAP_Bits.ADDRC */
#define IFX_EBU_BUS_WAP_ADDRC_OFF (28u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRAS */
#define IFX_EBU_SDRMCON_CRAS_LEN (4u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRAS */
#define IFX_EBU_SDRMCON_CRAS_MSK (0xfu)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRAS */
#define IFX_EBU_SDRMCON_CRAS_OFF (0u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRFSH */
#define IFX_EBU_SDRMCON_CRFSH_LEN (4u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRFSH */
#define IFX_EBU_SDRMCON_CRFSH_MSK (0xfu)

